# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Tenna\Documents\IHA\3. semester\IHA_3_Semester_Project\Hardware\Sensor_til_tandhjul\sensor_tandhjul\Design01.cydsn\Design01.cyprj
# Date: Fri, 20 May 2016 10:38:17 GMT
#set_units -time ns
create_clock -name {ADC_2_intClock(FFB)} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/ff_div_7}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {ADC_2_intClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 9 17} [list]
create_generated_clock -name {Clock_0} -source [get_pins {ClockBlock/hfclk}] -edges {1 11 21} -nominal_period 416.66666666666663 [list [get_pins {ClockBlock/udb_div_0}]]


# Component constraints for C:\Users\Tenna\Documents\IHA\3. semester\IHA_3_Semester_Project\Hardware\Sensor_til_tandhjul\sensor_tandhjul\Design01.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Tenna\Documents\IHA\3. semester\IHA_3_Semester_Project\Hardware\Sensor_til_tandhjul\sensor_tandhjul\Design01.cydsn\Design01.cyprj
# Date: Fri, 20 May 2016 10:38:12 GMT
